ERP DEV.WMS/src/InformationRegisters/вмс_АктивныеСеансы/вмс_АктивныеСеансы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_АктивныеСеансы</name>
  <resources>
    <name>ВидВзаимодействия</name>
    <type>
      <types>EnumRef.вмс_ВидыВзаимодействияСТерминалом</types>
    </type>
  </resources>
  <resources>
    <name>Операция</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </resources>
  <resources>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </resources>
  <resources>
    <name>Завершается</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>УникальныйИдентификаторБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УзелОбмена</name>
    <type>
      <types>ExchangePlanRef.МобильныйОбмен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_АктивныеСеансы/ManagerModule.bsl
Функция ИзменитьСтатусСеанса(УникальныйИдентификаторБазы = Неопределено, Оператор, Распоряжение = Неопределено, Операция = Неопределено, ВидВзаимодействия) Экспорт
	Если Не ЗначениеЗаполнено(Оператор) Тогда
		Возврат Ложь;
	КонецЕсли;
	СтруктураСеанса = ПолучитьЗаписьПоОператору(Оператор);
	Если Не ЗначениеЗаполнено(СтруктураСеанса) Тогда
		Возврат Ложь;
	КонецЕсли;
	УдалитьЗаписьСеанса(СтруктураСеанса);
	СоздатьНовуюЗапись(Новый Структура("УникальныйИдентификаторБазы, Оператор, Распоряжение, Операция, ВидВзаимодействия", УникальныйИдентификаторБазы, Оператор, Распоряжение, Операция, ВидВзаимодействия));
	
КонецФункции 

Функция ИзменитьСтатусСеансаПоСтруктуре(СтруктураСеанса) Экспорт
	Если Не ЗначениеЗаполнено(СтруктураСеанса.Оператор) Тогда
		Возврат Ложь;
	КонецЕсли;
	СтруктураПрошлогоСеанса = ПолучитьЗаписьПоОператору(СтруктураСеанса.Оператор);
	Если Не ЗначениеЗаполнено(СтруктураПрошлогоСеанса) Тогда
		СоздатьНовуюЗапись(СтруктураСеанса);
	КонецЕсли;	
	УдалитьЗаписьСеанса(СтруктураПрошлогоСеанса);
	СоздатьНовуюЗапись(СтруктураСеанса);
КонецФункции

Процедура СоздатьНовуюЗапись(СтруктураСеанса) Экспорт
	Запись =  РегистрыСведений.вмс_АктивныеСеансы.СоздатьМенеджерЗаписи();
	Запись.Заполнить(Неопределено);
	Запись.ДатаВремя = ТекущаяДатаСеанса();
	ЗаполнитьЗначенияСвойств(Запись, СтруктураСеанса);
	Запись.Записать();
КонецПроцедуры

Функция ПолучитьЗаписьПоОператору(Оператор)
	
	// ТУ_Алфимов 11.11.25 ++
	
	//лТекст = "
	//|ВЫБРАТЬ
	//|	вмс_АктивныеСеансы.УникальныйИдентификаторБазы КАК УникальныйИдентификаторБазы,
	//|	вмс_АктивныеСеансы.Оператор КАК Оператор,
	//|	вмс_АктивныеСеансы.Распоряжение КАК Распоряжение,
	//|	вмс_АктивныеСеансы.Операция КАК Операция,
	//|	вмс_АктивныеСеансы.ВидВзаимодействия КАК ВидВзаимодействия,
	//|ИЗ
	//|	РегистрСведений.вмс_АктивныеСеансы КАК вмс_АктивныеСеансы
	//|ГДЕ
	//|	вмс_АктивныеСеансы.Оператор = &Оператор
	//|";
	//Если Не ЗначениеЗаполнено(Оператор) Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	//СтруктураЗаписи = Неопределено;
	//Запрос = Новый Запрос(лТекст);
	//Запрос.УстановитьПараметр("Оператор" ,Оператор);
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	СтруктураЗаписи = Новый Структура("УникальныйИдентификаторБазы, Оператор, Распоряжение, Операция, ВидВзаимодействия", Выборка.УникальныйИдентификаторБазы, Выборка.Оператор, Выборка.Распоряжение, Выборка.Операция, Выборка.ВидВзаимодействия );	
	//КонецЦикла; 
	//
	//Возврат СтруктураЗаписи;
	
	ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	
	лТекст = 
	"ВЫБРАТЬ
	|	вмс_АктивныеСеансы.УникальныйИдентификаторБазы КАК УникальныйИдентификаторБазы,
	|	вмс_АктивныеСеансы.Оператор КАК Оператор,
	|	вмс_АктивныеСеансы.Распоряжение КАК Распоряжение,
	|	вмс_АктивныеСеансы.Операция КАК Операция,
	|	вмс_АктивныеСеансы.ВидВзаимодействия КАК ВидВзаимодействия,
	|	вмс_АктивныеСеансы.ДатаВремя КАК ДатаВремя
	|ИЗ
	|	РегистрСведений.вмс_АктивныеСеансы КАК вмс_АктивныеСеансы
	|ГДЕ
	|	вмс_АктивныеСеансы.ДатаВремя МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И вмс_АктивныеСеансы.Оператор = &Оператор";
	Если Не ЗначениеЗаполнено(Оператор) Тогда
		Возврат Ложь;
	КонецЕсли;
	СтруктураЗаписи = Неопределено;
	Запрос = Новый Запрос(лТекст);
	
	Запрос.УстановитьПараметр("Оператор" ,Оператор);
	Запрос.УстановитьПараметр("ДатаОкончания",ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураЗаписи = Новый Структура("УникальныйИдентификаторБазы, Оператор, Распоряжение, Операция, ВидВзаимодействия,ДатаВремя", Выборка.УникальныйИдентификаторБазы, Выборка.Оператор, Выборка.Распоряжение, Выборка.Операция, Выборка.ВидВзаимодействия, Выборка.ДатаВремя );	
	КонецЦикла; 
	
	Возврат СтруктураЗаписи;
	// ТУ_Алфимов 11.11.25 --
	
КонецФункции 

// ТУ_Мовчан 04.07.23
Функция ПолучитьСтатусЗавершения(Распоряжение, Операция, Оператор) Экспорт
	
	лТекст = "ВЫБРАТЬ
	|	вмс_АктивныеСеансы.Завершается КАК Завершается
	|ИЗ
	|	РегистрСведений.вмс_АктивныеСеансы КАК вмс_АктивныеСеансы
	|ГДЕ
	|	вмс_АктивныеСеансы.Операция = &Операция
	|	И вмс_АктивныеСеансы.Распоряжение = &Распоряжение
	|	И вмс_АктивныеСеансы.Завершается = ИСТИНА
	|	И вмс_АктивныеСеансы.Оператор <> &Оператор";	
	
	Запрос = Новый Запрос(лТекст);
	Запрос.УстановитьПараметр("Операция" ,Операция);
	Запрос.УстановитьПараметр("Распоряжение" ,Распоряжение);
	Запрос.УстановитьПараметр("Оператор" , Оператор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Ложь;
	Пока Выборка.Следующий() Цикл
		Результат = Истина;
		Прервать;
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьАктивностьСеансаПоОператору(СтруктураДанных) Экспорт
	
	Запись = ПолучитьЗаписьПоОператору(СтруктураДанных.Оператор);
	Если Запись = Неопределено Тогда
		Возврат Ложь;
	ИначеЕсли Запись.УникальныйИдентификаторБазы = СтруктураДанных.УникальныйИдентификаторБазы Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ЗакончитьАктивныйСеансОператора(Оператор) Экспорт	
	Если Не ЗначениеЗаполнено(Оператор) Тогда
		Возврат Ложь;
	КонецЕсли;
	СтруктураСеанса =  ПолучитьЗаписьПоОператору(Оператор);
	Если СтруктураСеанса = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	УдалитьЗаписьСеанса(СтруктураСеанса);
КонецФункции 

Процедура УдалитьЗаписьСеанса(СтруктураСеанса)
	Запись = РегистрыСведений.вмс_АктивныеСеансы.СоздатьМенеджерЗаписи();
	Запись.Заполнить(Неопределено);
	ЗаполнитьЗначенияСвойств(Запись, СтруктураСеанса);
	Запись.Удалить();
КонецПроцедуры
